In [122]:

import seaborn as sns
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder as le

In [10]:
titanic=pd.DataFrame(sns.load_dataset('titanic'))

In [173]:
titanicnew=pd.DataFrame(sns.load_dataset('titanic'))

In [27]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [29]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [31]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [39]:
titanic['deck']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [35]:
mean_age = titanic['age'].mean()
print(mean_age)

29.69911764705882

In [143]:
missing_values = titanic.isnull().sum()
missing_values

survived         0
pclass           0
sex              0
age            776
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           576
embark_town      2
alive            0
alone            0
family_size      0
dtype: int64

In [177]:

titanic.loc[:, 'age'] = titanicnew['age'].fillna(titanicnew['age'].median())
titanic.loc[:, 'embarked'] = titanicnew['embarked'].fillna(titanicnew['embarked'].mode()[0])

titanic.loc[:, 'deck'] = titanicnew['deck'].fillna(titanicnew['deck'].mode()[0])

In [178]:
missing_values_after = titanic.isnull().sum()
missing_values_after

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
family_size    0
dtype: int64

In [176]:
titanic['age'].unique()

array([22.  , 38.  , 26.  , 35.  , 28.  , 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  ,  8.  ,
       19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  , 49.  ,
       29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  , 16.  ,
       25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  , 71.  ,
       37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 , 51.  ,
       55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  , 45.5 ,
       20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  , 60.  ,
       10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  , 70.  ,
        6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [142]:
print("Initial Dupes")
duplicates=titanic.duplicated()

duplicates.sum()

Initial Dupes

259

In [180]:
duplicated_rows = titanic[duplicates]

titanic = titanic.drop_duplicates()

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,family_size
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False,2
1,1,1,female,38.0,1,0,14.4542,C,First,woman,False,C,Cherbourg,yes,False,2
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,2
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,C,Queenstown,no,False,6
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,28.0,1,2,23.4500,S,Third,woman,False,C,Southampton,no,False,4
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,C,Queenstown,no,True,1

In [181]:
titanic['sex'].unique()

array(['male', 'female'], dtype=object)

In [191]:
titanicage = titanic['age'].astype(int)

titanic.loc[:, 'age'] = titanicage

In [192]:
titanic['age'].describe()

count    770.000000
mean      29.574026
std       13.817512
min        0.000000
25%       21.000000
50%       28.000000
75%       36.000000
max       80.000000
Name: age, dtype: float64

In [86]:
titanic['fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [91]:
# Custom Function to detect outliers using IQR

def detect_outliers_iqr(column):
        Q1 = column.quantile(0.25)
        Q3 = column.quantile(0.75)
        IQR = Q3 - Q1
        lower_bound = Q1 - 1.5 * IQR
        upper_bound = Q3 + 1.5 * IQR
        return lower_bound, upper_bound

fare_lower_bound, fare_upper_bound = detect_outliers_iqr(titanic['fare'])

print(f"Fare outlier bounds: Lower = {fare_lower_bound}, Upper = {fare_upper_bound}")

Fare outlier bounds: Lower = -26.724, Upper = 65.6344

In [93]:
fare_outliers = titanic[(titanic['fare'] < fare_lower_bound) | (titanic['fare'] > fare_upper_bound)]
print(f"Number of outliers in 'fare' column: {fare_outliers.shape[0]}")

Number of outliers in 'fare' column: 116

In [94]:
titanic['fare'] = titanic['fare'].mask((titanic['fare'] < fare_lower_bound) | (titanic['fare'] > fare_upper_bound), titanic['fare'].median())
print("Outliers in 'Fare' column after handling:")
print(titanic['fare'][(titanic['fare'] < fare_lower_bound) | (titanic['fare'] > fare_upper_bound)])

Outliers in 'Fare' column after handling:
Series([], Name: fare, dtype: float64)

In [119]:
titanic['embarked'].fillna(titanic['embarked'].mode()[0], inplace=True)

In [121]:
titanic['embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [134]:
label_encoder =le()

titanic['embarked'] = label_encoder.fit_transform(titanic['embarked']) + 1

titanic['embarked'].unique()

array([3, 1, 2], dtype=int64)

In [132]:
print(titanic[['sibsp', 'parch']].head())

   sibsp  parch
0      1      0
1      1      0
2      0      0
3      1      0
4      0      0

In [205]:
titanic.loc[:, 'family_size'] = titanic['sibsp'] + titanic['parch'] + 1

print("\nDataFrame with 'family_size' feature:")
print(titanic[['sibsp', 'parch', 'family_size']].head())

DataFrame with 'family_size' feature:
   sibsp  parch  family_size
0      1      0            2
1      1      0            2
2      0      0            1
3      1      0            2
4      0      0            1

In [203]:
bins = [0, 12, 19, 60, 120]
labels = ['Child', 'Teen', 'Adult', 'Senior']

titanic.loc[:, 'age_category']  = pd.cut(titanic.loc[:, 'age'] , bins=bins, labels=labels, right=True)

In [204]:
titanic['age_category']

0      Adult
1      Adult
2      Adult
3      Adult
4      Adult
       ...
885    Adult
887     Teen
888    Adult
889    Adult
890    Adult
Name: age_category, Length: 770, dtype: category
Categories (4, object): ['Child' < 'Teen' < 'Adult' < 'Senior']